## 시스템 품질 요소 추정


### 사용자가 원하는 기대치

- **접근성** : 새로운 시스템을 도입하거나 별도의 클라이언트 프로그램을 설치할 필요 없이, 웹브라우저만으로 파일업로드 / 다운로드와 폴더 관리가 가능해야한다.
  
- **대용량 I/O처리** : 200명의 사용자가 동시에 접속해서 수백 단위의 파일이나 헤비한 문서를 다루더라도, 체감되는 레이턴시나 서버 다운이 없어야 한다.
  
- **신뢰성** : 잘못 덮어쓰거나, 실수 등으로 인해서 파일이 삭제됬을때, Version management나 휴지통 기능 등을 통해서 사용자가 간단하게 바로 복구할수 있어야 한다.
  
- **외부공유** : 외부 협력업체등과 협력할때, 만료 기간이 설정된 암호화 링크를 생성하여 간단하게 보안 유출 걱정 없이 업무를 진행할수 있도록 한다.



### 개발자 혹은 유지보수 담당자가 원하는 기대치

- **가벼운 아키텍쳐** : 기존의 Nextcloud같은 큰 오픈소스를 사용할 경우, 사용하지도 않는 여러 기능들로 인해 유지보수시의 난이도가 올라간다. 그래서 명시된 200명 규모에 맞는, 필요한 기능만 있는 가벼운 아키텍쳐로 설계되야한다.

- **유연한 확장성** : 이후에 문서 공동 편집기능, Ai 검색 기능이 추가 기능이 될때, 단순히 노드 추가만으로 성능을 유연하게 확장할 수 있는 설계가 필요하다.

- **장애 발생시 쉽게 원인 추적** : 시스템이 서비스되고 발생할 수 있는 여러 장애 상황때, 원인을 빠르게 파악할 수 있는 모니터링 환경이 필요하다.



### 개발 조직의 관리자가 원하는 기대치

- **철저한 보안** : On-premise환경에서 전송한 데이터의 암호화와 엄격한 access control등으로 보안을 철저하게 해야한다.

- **자원의 효율최적화** : 요구사항에 정의된 기능 구현과 안정화에 자원을 효율적으로 집중해서, 장애 등 리스크를 최소화 해야한다.



### 품질 요소 우선순위

1. **보안** : 이 프로젝트의 이유인 내부망 수준의 엄격한 보안이므로 보안에 대해선 타협이 불가하고, 이에 제일 높은 우선순위를 부여함.

2. **성능효율 및  신뢰성** : 200명 동시 접속 시 I/O 병목 해소와 데이터 무결성을 보장하는것이 시스템의 핵심이므로 두번쨰 우선순위로 부여했다.

3. **유지보수 및 확장성** : 서비스 과정중 발생하는 문제에 대한 유지 보수 및 미래에 추가될 기능을 고려하는 요소또한 중요함.

4. **사용성** : 클라이언트 설치 필요 없이 웹 브라우저 기반에서 요구한 기능들 까지 구현해서 사용자가 편하게 사용할수 있게 구성하는것이 중요하다.



### 품질 목표 설정

| 품질 속성 | 정량적 목표 (Target) | 설정 근거 및 고려사항 (Reasoning) |
| :--- | :--- | :--- |
| **성능효율** | - 1GB 파일 업로드 30초 이내 완료, 파일 검색시 API 응답 0.5초 이내 | - 사내 1Gbps 망에서 피크타임 동시 접속자를 20명(전체의 10%정도) 정도로 가정. 1인당 최소 30MB/s는 보장되어야 기존 클라우드 서비스(구글 드라이브 등)를 쓰던 유저들이 체감상 답답함을 느끼지 않음. |
| **신뢰성** | - 파일을 전송하다 끊겼을때, Chunked Upload기능 지원 | - 사내 Wi-Fi 특성상 대용량 파일 전송 중 네트워크가 끊기는 상황이 있을수 있다. 올리던 데이터를 날리고 처음부터 다시 올리지 않도록, 파일을 50MB 단위로 쪼개서 실패한 부분만 재전송하는 기능을 구현.|
| **보안성** | - 파일자체를 암호화(어플리케이션 레벨에서) 생략<br>- DB 사용자 정보 암호화 및 전송 구간 HTTPS 필수 적용 | - 어플리케이션레벨 에서 모든 업로드 파일을 암호화하면 CPU 오버헤드 때문에 스토리지 I/O 성능이 크게 저하됨.<br>- 사내망이라는걸 이용해서 파일 보관 자체는 스토리지(OS) 암호화에 넘기고, 개발레벨에서는 패킷 도청방지를 위해서 HTTPS보안에만 집중해서 성능을 확보를 노림. |



### 품질 속성간의 관계 분석

- **보안과 성능** : 전송과 저장 데이터 암호화는 CPU의 오버헤드를 발생시켜서 I/O throughput을 저하시킬수도 있음. 그래서 높은 보안정도를 유지하면서도 레이턴시를 최소화 하기위해서 암호화 모듈을 경량화 한다거나 하드웨어 가속 등 여러방안을 설계시에 고려해야한다.

- **확장성과 일관성** : 이후에 노드를 추가해서 확장을 할 경우, 여러 노드 간  ㅏ일 동기화로 인해 최신버전을 파악하는데 지연이 있을수  있음. 이에 대해 일관성을 어느정도까지 유지하고 양보해야하느냐에 대해 논의할 필요가 있음.


